WF/src/Documents/РасчетнаяВедомость/РасчетнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетнаяВедомость</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/InformationRegisters/ОкладыСотрудников/ОкладыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОкладыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WF/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.День</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВидыРасчета</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

WF/src/Documents/РасчетнаяВедомость/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого СтрокаСотрудника Из ЭтотОбъект.СписокСотрудников Цикл
		СтрокаСотрудника.Оклад = РегистрыСведений.ОкладыСотрудников.ПолучитьОклад(СтрокаСотрудника.Сотрудник, ЭтотОбъект.Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчета.Оклад;
		Движение.ПериодДействияНачало = НачалоМесяца(ЭтотОбъект.Дата);
		Движение.ПериодДействияКонец = КонецМесяца(ЭтотОбъект.Дата);
		Движение.ПериодРегистрации = ЭтотОбъект.Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Оклад = ТекСтрокаСписокСотрудников.Оклад;
	КонецЦикла; 
	Движения.Зарплата.Записать();
	Движения.Зарплата.Рассчитать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
